[
  {
    "Name": "Spaghetti Aglio e Olio",
    "PreparationSteps": "Cook the spaghetti in salted boiling water until al dente. Reserve some pasta water before draining. Heat olive oil in a pan over medium heat, then add thinly sliced garlic and chili flakes. Sauté until fragrant but not browned.Add the cooked spaghetti to the pan and toss with the garlic oil. Add reserved pasta water to loosen the sauce if needed. Season with salt and pepper to taste, garnish with fresh parsley, and serve.",
    "Likes": 4,
    "DifficultyLevel": 1,
    "CookId": 2,
    "CreatedOn": "2024-10-06T12:00:00",
    "UpdatedOn": "2024-10-06T12:00:00",
    "IsAdminApproved": true,
    "AdminNotes": null
  },
  {
    "Name": "Quinoa Salad",
    "PreparationSteps": "Cook quinoa in water (you can use vegetable broth if you like). Let it cool. In a large bowl, combine diced cucumber, cherry tomatoes, red onion, and avocado. Add the cooled quinoa and mix well. In a small bowl, whisk together lemon juice, olive oil, tahini, salt, and pepper. Pour the dressing over the salad and toss. Garnish with fresh herbs like parsley and cilantro and serve chilled.",
    "Likes": 10,
    "DifficultyLevel": 2,
    "CookId": 2,
    "CreatedOn": "2024-09-15T12:00:00",
    "UpdatedOn": "2024-09-15T12:00:00",
    "IsAdminApproved": true,
    "AdminNotes": null
  },
  {
    "Name": "Gluten-Free Almond Pancakes",
    "PreparationSteps": "In a bowl, whisk together almond flour, eggs, baking powder, vanilla extract, and a pinch of salt until smooth. Heat a non-stick pan over medium heat and grease lightly with butter. Pour small amounts of batter onto the pan and cook until bubbles form on the surface, then flip and cook the other side until golden brown. Serve pancakes with fresh berries, maple syrup, and a sprinkle of almond slices for garnish.",
    "Likes": 30,
    "DifficultyLevel": 2,
    "CookId": 3,
    "CreatedOn": "2024-08-22T12:00:00",
    "UpdatedOn": "2024-08-22T12:00:00",
    "IsAdminApproved": true,
    "AdminNotes": null
  },
  {
    "Name": "Spicy Chicken Tacos",
    "PreparationSteps": "Marinate chicken breast in a mixture of chili powder, cumin, paprika, garlic, lime juice, and olive oil for at least 30 minutes. Cook the marinated chicken in a pan over medium heat until fully cooked and slightly charred. Warm the taco shells in the oven or on a pan. Assemble the tacos by adding chicken, finely chopped ripe tomatoes, onion, cilantro, jalapeño, and lime, and avocado.",
    "Likes": 3,
    "DifficultyLevel": 2,
    "CookId": 1,
    "CreatedOn": "2024-07-10T12:00:00",
    "UpdatedOn": "2024-07-10T12:00:00",
    "IsAdminApproved": true,
    "AdminNotes": null
  },
  {
    "Name": "Classic Beef Stroganoff",
    "PreparationSteps": "Cook egg noodles according to package instructions, drain, and set aside. In a large pan, brown strips of beef in butter over high heat. Remove from the pan and set aside. In the same pan, sauté onions and mushrooms until softened. Add garlic and cook for another minute. Stir in beef broth, mustard, and Worcestershire sauce, then return the beef to the pan. Reduce heat, stir in sour cream, and simmer until the sauce thickens. Serve the beef stroganoff over egg noodles, garnished with fresh parsley.",
    "Likes": 10,
    "DifficultyLevel": 3,
    "CookId": 3,
    "CreatedOn": "2024-06-05T12:00:00",
    "UpdatedOn": "2024-06-05T12:00:00",
    "IsAdminApproved": true,
    "AdminNotes": null
  }
]
